tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jesseduffield/lazydocker"
tap "homebrew/cask-fonts"
tap "homebrew/cask"

# Terminal
cask "ghostty"
cask "alacritty"
brew "zellij"
brew "zsh"
brew "antidote"

# CLI tools
brew "git"
brew "git-delta"  # git diff alternative
brew "ack"        # grep alternative
brew "webp"
brew "bat"        # cat alternative
brew "fzf"        # fuzzy finder
brew "gawk"
brew "btop"       # top alternative
brew "hugo"
brew "jq"
brew "ripgrep"
brew "stow"
brew "tree"
brew "wget"
brew "zoxide"      # cd alternative

# Dev tools
brew "neovim"
cask "zed"
brew "kubernetes-cli"
brew "kubectx"
brew "gh"
brew "mise"
brew "jesseduffield/lazygit/lazygit"
brew "jesseduffield/lazydocker/lazydocker"

# Apps
cask "raycast"        # Spotlight replacement
cask "tiles"          # Window manager
cask "telegram"
cask "google-chrome"
cask "brave-browser"
cask "obsidian"
cask "1password"

# Fonts
cask "font-jetbrains-mono"
cask "font-fira-code-nerd-font"
